#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-095704145286cae2e]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f67803175a935379]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0344a822d47db7f9b]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-018cb251aa01106a6]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-09a634edf9cd8550e]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ae195646db0ef040]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-044d413a2b8e8cfa6]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01725363754ad7a53]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0dcf06b76ace9b643]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04bdb6a0bc76404f7]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f69bc3d39f66175]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06d491c7b33e45d5a]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06fdb21315cbd6b6d]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0346831deb9b86791]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-096ad07a1ef1e21fa]
module.ec2_cluster.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06fcaa04f3b4e133f]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-02db6b713faa62f7e]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-072313abee9f080b7]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c24e0ab9e0a4aa5e]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00002622ff9b2fdef]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04e8e1ed1b29bb816]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0576c02184fb0fbf2]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0346831deb9b867911080289494]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-08bb988dd9c9370ed]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0679156be95ae08f8]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b813388d19123158]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-74221365]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3670659615]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[1]: Refreshing state... [id=i-04456e6025d45c7c7]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[2]: Refreshing state... [id=i-0af1e2059b62bfaa0]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[0]: Refreshing state... [id=i-0fc2b2190f82c04c9]
module.ec2_cluster.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2328510255]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-044d413a2b8e8cfa61080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ae195646db0ef0401080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-09a634edf9cd8550e1080289494]
module.ec2_cluster.aws_ebs_volume.this[1]: Refreshing state... [id=vol-0529325c633b4b19b]
module.ec2_cluster.aws_ebs_volume.this[2]: Refreshing state... [id=vol-0722405f1b42a7e5b]
module.ec2_cluster.aws_ebs_volume.this[0]: Refreshing state... [id=vol-04fe586c7f4f3f0c8]
module.ec2_cluster.aws_volume_attachment.this_ec2[1]: Refreshing state... [id=vai-75373139]
module.ec2_cluster.aws_volume_attachment.this_ec2[2]: Refreshing state... [id=vai-16423808]
module.ec2_cluster.aws_volume_attachment.this_ec2[0]: Refreshing state... [id=vai-1143338520]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_cluster.aws_ebs_volume.this[3] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 1
      + snapshot_id       = (known after apply)
      + type              = "gp2"
    }

  # module.ec2_cluster.aws_volume_attachment.this_ec2[3] will be created
  + resource "aws_volume_attachment" "this_ec2" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.ec2_cluster.module.ec2_cluster.aws_instance.this[3] will be created
  + resource "aws_instance" "this" {
      + ami                          = "ami-09b9e380df60300c8"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + disable_api_termination      = false
      + ebs_optimized                = false
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + monitoring                   = false
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-06fdb21315cbd6b6d"
      + tags                         = {
          + "Name" = "awesome-ec2-cluster-4"
        }
      + tenancy                      = "default"
      + volume_tags                  = {
          + "Name" = "awesome-ec2-cluster-4"
        }
      + vpc_security_group_ids       = [
          + "sg-06fcaa04f3b4e133f",
        ]

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @bmbferreira, Action: `pull_request`, Working Directory: `terraform/production`, Workflow: `Awesome Terraform Workflow`*